#*********************************************************************
# التعامل مع النصوص (Strings) – أساس كل حاجة


text = "2x-10"

# طول النص
print(len(text))  # 5

# الوصول لحرف محدد
print(text[0])    # '2'

# slicing (أخذ جزء من النص)
print(text[:1])   # '2'
print(text[1:])   # 'x-10'
print(text[1:4])  # 'x-1'

# إيجاد موقع حرف
print(text.find('x'))  # 1

# إزالة الفراغات
text2 = " 2x - 10 "
print(text2.replace(" ", ""))  # '2x-10'



#***********************************************************************
#التحويل بين النصوص والأرقام


a_str = "2"
a = int(a_str)  # تحويل النص لرقم صحيح

b_str = "-10"
b = int(b_str)  # -10

c = 3.5
c_str = str(c)  # تحويل رقم نص
